# Выведите количество слов в строке
test = input().split()
print(len(test))
